app/controllers/songs_controller.rb

  def index
    if artist = Artist.find_by(id: params[:artist_id])
      @songs = artist.songs
    elsif params[:artist_id] && !artist
      redirect_to artists_path
      flash[:alert] = "Artist not found."
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]

  def show
    artist = Artist.find_by(id: params[:artist_id])
    @song = Song.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]